{
  "results": [
    {
      "WEBPAGE_TITLE": "S&P 500 Gains and Losses Today: Supermicro, Arista Networks, and Nvidia Lead Tech Selloff - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/p-500-gains-losses-today-205835836.html",
      "WEBPAGE_CONTENT": "Finance New on Yahoo Yahoo Finance In This Article: The S&P 500 fell 1.1% on Wednesday, March 26, 2025, as tech stocks faltered and the White House prepared to announce tariffs on car imports. The S&P 500 dropped 1.1%, while the Dow slipped 0.3%. Nvidia (NVDA) stock slipped 5.7%, leading losses on the Dow, amid concerns about additional constraints on AI chip sales in China. The stock had gained more than 27% in the week leading up to Wednesday's session, boosted by the potential for watered-down tariffs and several endorsements. Discount retailer Dollar Tree (DLTR) announced a deal to sell its Family Dollar brand to the private equity firms Brigade Capital Management and Macellum Capital Management for $1 billion. Read the original article on Investopedia"
    },
    {
      "WEBPAGE_TITLE": "Stock Market Today: Dow, Nasdaq and S&P 500 look to consolidate after stocks hit three-week high as tariff day looms; GameStop pops. - MarketWatch",
      "WEBPAGE_URL": "https://www.marketwatch.com/livecoverage/stock-market-today-dow-s-p-and-nasdaq-on-tap-to-consolidate-after-stocks-rally-to-3-week-high",
      "WEBPAGE_CONTENT": "Stock Market Today: Dow, Nasdaq and S&P 500 look to consolidate after stocks hit three-week high as tariff day looms; GameStop pops. Stock Market Today: Dow, Nasdaq and S&P 500 look to consolidate after stocks hit three-week high as tariff day looms; GameStop pops. Follow all the latest U.S. market action for Wednesday here to see if the S&P 500 can extend its three-day winning streak. There was better news on the global inflation front early Wednesday, when data showed consumer prices in the U.K. rose in the year to February by 2.8%, down from January's 3% increase and less than forecasts of 2.9%. Real-time last sale data for U.S. stock quotes reflect trades reported through Nasdaq only."
    },
    {
      "WEBPAGE_TITLE": "S&P 500 Gains and Losses Today: Supermicro, Arista Networks, and Nvidia Lead Tech Selloff - Investopedia",
      "WEBPAGE_URL": "https://www.investopedia.com/s-and-p-500-gains-and-losses-today-supermicro-arista-networks-and-nvidia-lead-tech-selloff-11703847",
      "WEBPAGE_CONTENT": "Top Stock Movers Now: Nvidia, Vertiv, Dollar Tree, and More S&P 500 Gains and Losses Today: Boeing Surges on Several Positive Signals Markets News, March 14, 2025: Stocks Soar to Their Best Day of 2025 as Nvidia and Palantir Lead Tech Rally; Major Indexes Still Down for 4th Straight Week Markets News, March 4, 2025: Stocks Close Lower as Tariffs, Economic Concerns Weigh on Sentiment; Banks Lead Broad-Based Decline The Magnificent Seven Stocks Just Had Their Worst Day Since July Top Stock Movers Now: Tesla, DexCom, Strategy, and More Elon Musk Told Tesla Workers to 'Hang On.' The Stock Rose Today."
    },
    {
      "WEBPAGE_TITLE": "Stock Market on March 28, 2025: Dow, S&P 500, Nasdaq see worst day in almost three weeks after inflation, consumer-sentiment reports; stocks post weekly drop to deepen March losses ahead of reciprocal tariffs - MarketWatch",
      "WEBPAGE_URL": "https://www.marketwatch.com/livecoverage/stock-market-today-dow-s-p-500-and-nasdaq-set-for-weaker-start-ahead-of-pce-data",
      "WEBPAGE_CONTENT": "Stock Market on March 28, 2025: Dow, S&P 500, Nasdaq see worst day in almost three weeks after inflation, consumer-sentiment reports; stocks post weekly drop to deepen March losses ahead of reciprocal tariffs - MarketWatch Stock Market on March 28, 2025: Dow, S&P 500, Nasdaq see worst day in almost three weeks after inflation, consumer-sentiment reports; stocks post weekly drop to deepen March losses ahead of reciprocal tariffs The U.S. stock market closed sharply down Friday, booking weekly losses as investors fretted over the potential for tariffs to weigh on consumer spending and weaken the economy. All three major U.S. stock indexes posted on Friday their biggest daily drops since March 10, according to Dow Jones Market Data."
    },
    {
      "WEBPAGE_TITLE": "Stock Market Today: Dow falls 400 points, S&P 500 heads for fifth-straight weekly loss as traders and companies weigh risks of tariff uncertainty; FedEx, Nike shares slump - MarketWatch",
      "WEBPAGE_URL": "https://www.marketwatch.com/livecoverage/stock-market-today-dow-s-p-500-and-nasdaq-set-for-weaker-start-fedex-nike-shares-slump",
      "WEBPAGE_CONTENT": "Stock Market Today: Dow, S&P 500, Nasdaq fall Friday as companies weigh tariff risks; FedEx, Nike shares slump. Stock Market Today: Dow, S&P 500, Nasdaq fall Friday as companies weigh tariff risks; FedEx, Nike shares slump. For the week, the S&P 500 was on pace to fall 0.4%, the technology-heavy Nasdaq was heading for a 1.1% drop and the Dow was on track to gain 0.4%, according to FactSet data midday Friday. Roughly 84% of S&P 500 stocks were in the red in recent trading, according to Dow Jones Market Data. An exchange-traded fund that holds seven closely watched Big Tech stocks was falling Friday, on track for a weekly loss after big drops for Nvidia Corp."
    },
    {
      "WEBPAGE_TITLE": "Dow Jones Today: S&P 500, Nasdaq Slide After Three Straight Days of Gains; Nvidia, Tesla Lead Tech Slump - Investopedia",
      "WEBPAGE_URL": "https://www.investopedia.com/dow-jones-today-03262025-11703484",
      "WEBPAGE_CONTENT": "Markets News, March 20, 2025: Stocks Close Slightly Lower as Rebound Rally Stumbles; Accenture Plunges as Government Spending Cuts Weigh on Revenue Markets News, March 10, 2025: Stocks Plunge as Tariffs, Talk of Recession Dent Sentiment; Tesla Tumbles to Lead Nasdaq to Worst Day Since 2022 Markets News, March 11, 2025: Stocks Close Lower to Extend Sell-Off Amid Fresh Concerns About Tariffs, Economic Uncertainty Markets News, March 7, 2025: Stocks Close Higher After Fed's Powell Says Economy in Good Shape; S&P 500, Nasdaq Post 3rd Straight Weekly Decline Markets News, March 4, 2025: Stocks Close Lower as Tariffs, Economic Concerns Weigh on Sentiment; Banks Lead Broad-Based Decline Markets News, February 25, 2025: S&P 500, Nasdaq Fall for 4th Straight Day as Tesla Leads Tech Slump; Walmart, Home Depot Boost Dow Markets News, February 26, 2025: S&P 500, Nasdaq Composite Inch Higher to Snap Losing Run; Nvidia Jumps Ahead of Earnings, Tesla Extends Slump Markets News, March 5, 2025: Stocks Surge as Automakers Get One-Month Reprieve from Tariffs; Ford, GM, Stellantis Shares Soar"
    },
    {
      "WEBPAGE_TITLE": "Stock Market Today: Dow, S&P 500 Fall After Trump Auto Tariffs News - Barron's",
      "WEBPAGE_URL": "https://www.barrons.com/livecoverage/stock-market-today-032725",
      "WEBPAGE_CONTENT": "Stock Market News: Dow Falls After Auto Tariff Announcement The S&P 500 and the tech-heavy Nasdaq were also lower on Thursday. Last Updated: Stocks Fall as Wall Street Remains in a Holding Pattern Dow Drops 300 Points As Tariff Worries Return Stocks Slide Amid Wall Street's Tariff Worries Stock Futures Wobble After Trump Auto Tariff Latest Updates Crude futures settle higher with the market weighing the impact of potential supply disruptions against the economic impact of U.S. tariffs. The gradual rally from the March 5 low of $65.22 for WTI could be a mixture of genuine supply concerns around Canadian, Mexican and Venezuelan oil and a technical bounce from a oversold market, Mizuho's Robert Yawger says in a note."
    },
    {
      "WEBPAGE_TITLE": "Stock market today: Dow, S&P 500, Nasdaq futures poised to kick off new week with gains - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-jump-amid-hopes-trump-will-soften-next-tariff-blow-005931248.html",
      "WEBPAGE_CONTENT": "Finance New on Yahoo Yahoo Finance US stock futures jumped on Monday as investors welcomed reports that the next wave of President Trump's tariffs will be more targeted than threatened. S&P 500 futures (ES=F) rose 0.9% on the heels of the broad benchmark snapping a four-week losing streak. Dow Jones Industrial Average futures (YM=F) advanced 0.7%, while contracts on the tech-heavy Nasdaq 100 (NQ=F) led the gains, up 1.1%. Looking at economic data for the week to come, a reading of the Fed's preferred inflation gauge, the Personal Consumption Expenditures Index, is due Friday. The PCE comes alongside a treading of the University of Michigan's consumer confidence survey, as well as updates to Purchasing Managers' Indexes for the manufacturing and services sectors."
    },
    {
      "WEBPAGE_TITLE": "Stock market today: Nasdaq, S&P 500 lead stock slide as Trump set to announce auto tariffs - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/live/stock-market-today-nasdaq-sp-500-lead-stock-slide-as-trump-set-to-announce-auto-tariffs-230931494.html",
      "WEBPAGE_CONTENT": "Breaking News • 5 hours ago Dow, S&P 500, Nasdaq hold broadly steady as Trump keeps Wall Street guessing on tariffs News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' Breaking News • 2 days ago Dow, S&P 500, Nasdaq jump amid hopes that Trump will soften the next wave of tariffs News • 2 days ago How Trump tariffs could affect the sports industry — including golf Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs Breaking News • 5 days ago Stocks slip as Wall Street fails to build on Wednesday's Fed-fueled rally"
    },
    {
      "WEBPAGE_TITLE": "Stock market today: Dow drops 700 points, S&P 500, Nasdaq sink as Wall Street reels from tariff, inflation fears - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-drops-700-points-sp-500-nasdaq-sink-as-wall-street-reels-from-tariff-inflation-fears-200045524.html",
      "WEBPAGE_CONTENT": "Stock market today: Dow drops 700 points, S&P 500, Nasdaq sink as Wall Street reels from tariff, inflation fears Stock market today: Dow drops 700 points, S&P 500, Nasdaq sink as Wall Street reels from tariff, inflation fears US stocks tanked on Friday as Wall Street grappled with President Trump's escalating trade war and weighed signs of reinvigorated inflation pressures amid souring consumer sentiment. The Dow Jones Industrial Average (^DJI) dropped more than 700 points or nearly 1.7%, while the benchmark S&P 500 (^GSPC) fell almost 2%. Fed officials have projected higher inflation and slower economic growth amid new tariffs, though Fed Chair Jerome Powell has reassured Wall Street that rising prices will likely be \"transitory.\" Dow Jones S&P 500 DAX Index Nvidia Tesla DJT Tariffs"
    },
    {
      "WEBPAGE_TITLE": "Stock Market News: Dow Stalls as Tariff Uncertainty Grips Markets - Barron's",
      "WEBPAGE_URL": "https://www.barrons.com/livecoverage/stock-market-today-032625",
      "WEBPAGE_CONTENT": "Stock Market Today: Google, Amazon, and Other Mag 7 Stocks Drop; Dow, S&P 500, Nasdaq Fall; Trump Tariff News Stock Market News: Big Tech Stocks Drag Nasdaq Lower DJIA DJIA (Dow Jones Global) 42385.15-202.35-0.48%S&P 500 SPX (S&P US) 5705.15-71.50-1.24%Nasdaq COMP (Nasdaq) 17886.35-385.51-2.11% GameStop will add Bitcoin as a treasury reserve asset, Tesla stock falls after closing higher for five-straight sessions, and Dollar Tree reaches a deal to sell its Family Dollar business for more than $1 billion. DJIA DJIA (Dow Jones Global) 42384.58-202.92-0.48%S&P 500 SPX (S&P US) 5705.04-71.61-1.24%Nasdaq COMP (Nasdaq) 17885.96-385.89-2.11% The S&P 500 was struggling after Barclays head of U.S. equity strategy Venu Krishna became one of the most bearish strategists among the major investment banks."
    },
    {
      "WEBPAGE_TITLE": "S&P 500 Gains and Losses Today: Tesla Stock Soars on Driving-Assistance Plans in China - Investopedia",
      "WEBPAGE_URL": "https://www.investopedia.com/s-and-p-500-gains-and-losses-today-11702208",
      "WEBPAGE_CONTENT": "S&P 500 Gains and Losses Today: Tesla Stock Soars on Driving-Assistance Plans in China S&P 500 Gains and Losses Today: Supermicro Stock Falls as Near-Term AI Outlook Wavers S&P 500 Gains and Losses Today: Index Ticks Higher Ahead of This Week's Fed Decision S&P 500 Gains and Losses Today: Tech Stocks Bounce Back After Soft Inflation Data S&P 500 Gains and Losses Today: Index Tumbles as Economic Concerns Intensify S&P 500 Gains and Losses Today: Teradyne Stock Plunges as Firm Foresees Tariff Effects Is the Magnificent Seven No More? Top Stock Movers Now: Tesla, Nucor, Supermicro, and More S&P 500 Gains and Losses Today: Accenture, Gartner Stocks Pressured by Government Spending Cuts How Sustainable Is the Current Stock Market Rally?"
    },
    {
      "WEBPAGE_TITLE": "Stocks Fall as Inflation Anxiety Dampens Mood on Wall Street - The New York Times",
      "WEBPAGE_URL": "https://www.nytimes.com/2025/03/28/business/stock-market-inflation-consumer-sentiment.html",
      "WEBPAGE_CONTENT": "The S&P 500 index dropped 2 percent as investors weighed hotter-than-expected inflation data and braced for President Trump’s next round of tariffs. Concerns about inflation and weak consumer sentiment dragged down the stock market on Friday, as Wall Street keeps struggling to assess the path forward for the U.S. economy with the full impact of President Trump’s tariffs looming. March is on track to be the stock market’s worst month since September 2022; waves of selling in recent weeks at one point left the S&P 500 more than 10 percent below its Feb. 19 peak, a downturn considered a market “correction.” Wall Street sentiment has been dampened by concerns that President Trump’s tariffs and a trade war could push prices sharply higher, discourage consumers and force the economy toward a recession."
    },
    {
      "WEBPAGE_TITLE": "Stock market today: Dow, S&P 500, Nasdaq futures poised to kick off new week with gains - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-poised-to-kick-off-new-week-with-gains-005931845.html",
      "WEBPAGE_CONTENT": "Finance New on Yahoo Yahoo Finance US stock futures rose on Monday, as the major indexes looked for another week of gains. Futures attached to the benchmark S&P 500 (ES=F) rose 1%, with Nasdaq 100 (NQ=F) futures up 1.3%. Futures tied to the Dow Jones Industrial Average (YM=F) advanced around 0.8%. (ES=F) Trump indicated on Friday that he is maintaining \"flexibility\" in relation to the tariffs' rollout, but he hasn't given a firm idea of what that would look like. Other concerns for Wall Street include considerations over whether the year-to-date losses have only been a slowdown blip — or if the economy is heading into a recession. JPMorgan strategist Bruch Kasman, for one, pegs the chance of recession as high as 40%."
    },
    {
      "WEBPAGE_TITLE": "Morning Bid: The confidence game - Reuters",
      "WEBPAGE_URL": "https://www.reuters.com/markets/us/global-markets-view-usa-2025-03-25/",
      "WEBPAGE_CONTENT": "By Mike Dolan, opens new tab, Editor-At-Large, Financial Industry and Financial Markets The upshot for stock markets was that the S&P 500 (.SPX), opens new tab rose almost 2% on Monday to end at its highest point in over two weeks, led by Big Tech, including chip giant Nvidia (NVDA.O), opens new tab and Elon Musk's Tesla (TSLA.O), opens new tab, which enjoyed a 12% surge. This month's release of the Federal Reserve's, opens new tab quarterly statistics on U.S. financial accounts highlighted the rising asset wealth and modest debt load of households and businesses at the end of 2024. About Reuters, opens new tab"
    },
    {
      "WEBPAGE_TITLE": "Stock market today: Dow, S&P 500, Nasdaq hit pause as Trump keeps Wall Street guessing on tariffs - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-hit-pause-as-trump-keeps-wall-street-guessing-on-tariffs-230931262.html",
      "WEBPAGE_CONTENT": "Breaking News • 1 hour ago Dow, S&P 500, Nasdaq hold broadly steady as Trump keeps Wall Street guessing on tariffs Breaking News • yesterday Stocks edge higher as Wall Street navigates Trump's plans for tariffs Breaking News • 2 days ago Dow, S&P 500, Nasdaq jump amid hopes that Trump will soften the next wave of tariffs News • 2 days ago How Trump tariffs could affect the sports industry — including golf Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs Breaking News • 5 days ago Stocks slip as Wall Street fails to build on Wednesday's Fed-fueled rally"
    },
    {
      "WEBPAGE_TITLE": "Stock Market News: Dow Rises Ahead of Consumer Confidence Data - Barron's",
      "WEBPAGE_URL": "https://www.barrons.com/livecoverage/stock-market-today-032525",
      "WEBPAGE_CONTENT": "Stock Market Today: Dow, S&P 500, Nasdaq Open Up; Consumer Confidence; Trump Tariffs; Tesla, Nvidia, Broadcom, SMCI, More Movers Barron's Buy Side from WSJ Barron's 400 1230.44 2.08 LIVE UPDATES Stock Market News: Dow Slips After Consumer Confidence Data #### Stocks Edge Higher. #### Treasury Yields Rise Ahead of U.S. Housing, Confidence Data #### Chinese Tech Stocks Near Correction Territory on Data Center Bubble Fears #### Stock Futures Stall Amid Trump Tariff Uncertainty #### European Stocks Rise, Shrugging Off U.S. Tariff Fears #### Trump Tariff Uncertainty Will Break This Stock Market Calm, Brace for Another Storm. #### Wall Street Fear Index Climbs. Data Stock Picks Barron's Live Barron's Stock Screen Subscribe to Barron's About Barron's Data Policy"
    },
    {
      "WEBPAGE_TITLE": "ChatGPT Can Now Edit Photos Better and Create Charts for Work - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/chatgpt-now-edit-photos-better-180034805.html",
      "WEBPAGE_CONTENT": "Breaking News • 5 hours ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs Breaking News • 11 hours ago Dow, S&P 500, Nasdaq hold broadly steady as Trump keeps Wall Street guessing on tariffs News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' News • 3 days ago How Trump tariffs could affect the sports industry — including golf News • 4 days ago The real estate world is fighting over secret listings and the future of how homes are sold Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs"
    },
    {
      "WEBPAGE_TITLE": "Lululemon Athletica (LULU) Surged on Strong Performance Metrics - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/lululemon-athletica-lulu-surged-strong-120328689.html",
      "WEBPAGE_CONTENT": "Breaking News • 2 hours ago Dow drops 700 points, S&P 500, Nasdaq sink as Wall Street reels from tariff, inflation fears Breaking News • 2 days ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs Breaking News • 2 days ago The Nasdaq led declines, sinking over 2%, as the White House said Trump would announce new auto tariffs later today. Breaking News • 2 days ago Dow, S&P 500, Nasdaq hold broadly steady as Trump keeps Wall Street guessing on tariffs Breaking News • 3 days ago Stocks edge higher as Wall Street navigates Trump's plans for tariffs Breaking News • 4 days ago Dow, S&P 500, Nasdaq jump amid hopes that Trump will soften the next wave of tariffs"
    },
    {
      "WEBPAGE_TITLE": "Dow Set to Open Down as Market Focus Returns to Trump Tariffs - Barron's",
      "WEBPAGE_URL": "https://www.barrons.com/livecoverage/stock-market-today-032125",
      "WEBPAGE_CONTENT": "\nLIVE UPDATES\nDow Opens Down on Triple Witching Day\nThe S&P 500 and Nasdaq Composite are also falling in afternoon trading.\nLast Updated: \nMarch 21, 2025 at 12:06 PM EDT\nStocks Are Staring at 5 Straig"
    },
    {
      "WEBPAGE_TITLE": "S&P 500: Prepare For More Hits. Week Starting 24th March (Technical Analysis) (SP500) - Seeking Alpha",
      "WEBPAGE_URL": "https://seekingalpha.com/article/4769794-sp500-prepare-for-more-hits-week-starting-24-march",
      "WEBPAGE_CONTENT": "Week Starting 24th March (Technical Analysis) (SP500) | Seeking Alpha Stock Analysis Stock Ideas Energy Stock News Tech Stock News Top Dividend Stocks Top Quant Dividend Stocks Dividend News - Stocks ETFs Emerging Markets ETFs All Stocks Top Rated Stocks Top Growth Stocks Top Value Stocks Most Shorted Stocks All ETFs Dividend Stocks Value Stocks Gold ETFs VIX Risk Indicator Pricing In Calmer Waters For U.S. Stock Market In Near Term Dividend Investing Growth Stocks Tech Stocks Stock Market Sectors Stock Market Holidays & Hours Dividend Investing Stock Analysis Stock Ideas Top Stocks Top Quant Dividend Stocks High Dividend Yield Stocks Top Dividend Stocks ETF Analysis Dividend Stock News Gold ETFs Dividend ETFs Emerging Market ETFs Market Cap ETFs Sector ETFs Dividends - Stocks"
    },
    {
      "WEBPAGE_TITLE": "Stock market today: Wall Street drifts as Nvidia, Tesla and Big Tech drop - The Associated Press",
      "WEBPAGE_URL": "https://apnews.com/article/stocks-markets-trump-rates-inflation-352fd536517d6824d7006c429651e3a2",
      "WEBPAGE_CONTENT": "Stock market today: Wall Street slumps as Nvidia, Tesla and other Big Tech stocks drop The group of dominant stocks known as the “Magnificent Seven” has been at the center of the U.S. stock market’s recent sell-off, which earlier this month took the S&P 500 10% below its all-time high for its first “correction” since 2023. Other U.S. automakers went on their own sharp swings after the White House said President Donald Trump would announce tariffs on auto imports at 4 p.m. Eastern time Wednesday, when the U.S. stock market closes. Treasury yields in the bond market, which often move with expectations for the U.S. economy’s strength, swiveled up and down following the report."
    },
    {
      "WEBPAGE_TITLE": "‘Assassin’s Creed’ Maker Agrees €4 Billion Tencent Carve Out - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/ubisoft-carves-top-games-unit-164015707.html",
      "WEBPAGE_CONTENT": "Breaking News • 22 hours ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs Breaking News • 2 days ago Stocks edge higher as Wall Street navigates Trump's plans for tariffs News • 3 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' Breaking News • 3 days ago Dow, S&P 500, Nasdaq jump amid hopes that Trump will soften the next wave of tariffs News • 3 days ago How Trump tariffs could affect the sports industry — including golf News • 4 days ago The real estate world is fighting over secret listings and the future of how homes are sold Breaking News • 6 days ago Stocks slide as Wall Street weighs Fed's message, tariffs"
    },
    {
      "WEBPAGE_TITLE": "What To Expect in the Markets This Week - Investopedia",
      "WEBPAGE_URL": "https://www.investopedia.com/what-to-expect-in-the-markets-this-week-11700527",
      "WEBPAGE_CONTENT": "What To Expect in the Markets This Week What To Expect in the Markets This Week Markets News, March 18, 2025: Stocks Close Lower as Nascent Rally Stumbles; Tesla Extends Selloff, Nvidia Falls After CEO Remarks Markets News, March 19, 2025: Stocks Close Higher as Fed Holds Key Rate Steady, Cites Increased Economic Uncertainty; Boeing, Tesla Among Top Gainers Markets News, February 27, 2025: Stocks Plunge as Nvidia Earnings Spark Tech Sell-Off, Investors Digest Latest News on Tariffs Markets News, March 12, 2025: S&P 500, Nasdaq Rise After Encouraging CPI Inflation Report; Tesla, Nvidia Lead Tech Sector Rally What To Expect in the Markets This Week What To Expect in the Markets This Week"
    },
    {
      "WEBPAGE_TITLE": "Trading Day: Consolidating while awaiting tariff clarity - Reuters",
      "WEBPAGE_URL": "https://www.reuters.com/markets/global-markets-trading-day-2025-03-21/",
      "WEBPAGE_CONTENT": "Many of the world's major central banks sent a strong message this week that the uncertainty caused by U.S. President Donald Trump's trade wars is weighing on growth, stoking inflation, and dramatically reducing visibility on the interest rate outlook. The MSCI World equity index snapped a four-week losing streak for a rise of 0.7%, the S&P 500 rose 0.5%, the Nasdaq eked out a gain of 0.17% - just avoiding its worst run since the 2022 bear market - while European stocks gained more than 1% for their best week in five weeks. They do not reflect the views of Reuters News, which, under the Trust Principles, opens new tab, is committed to integrity, independence, and freedom from bias. About Reuters, opens new tab Reuters News Agency, opens new tab"
    },
    {
      "WEBPAGE_TITLE": "Top Stock Movers Now: FedEx, Nike, Lennar, and More - Investopedia",
      "WEBPAGE_URL": "https://www.investopedia.com/top-stock-movers-now-fedex-nike-lennar-and-more-11701160",
      "WEBPAGE_CONTENT": "FedEx (FDX) was the worst-performing stock in the S&P 500 after the package delivery giant slashed its outlook on \"weakness and uncertainty in the U.S. industrial economy.\" Nike (NKE) also warned that tariffs and sliding consumer confidence would hurt demand, and shares of the athletic apparel maker sank. Shares of Lennar (LEN) slid when the homebuilder warned of a weak housing market. Tesla (TSLA) shares advanced after CEO Elon Musk held an all-hands meeting where he expressed optimism about the future of the electric vehicle (EV) maker, easing worries he's spending too much time away working with the Trump administration. Oil futures and the yield on the 10-year Treasury note were little changed."
    },
    {
      "WEBPAGE_TITLE": "Charting the S&P 500: A Respite for the Downtrend, But... - TheStreet",
      "WEBPAGE_URL": "https://pro.thestreet.com/portfolio/charting-the-s-p-500-a-respite-for-the-downtrend-but",
      "WEBPAGE_CONTENT": "Published Time: 2025-03-24T13:30:00Z - TheStreet Pro TheStreet Pro Publish date: Get 1 month free of unlimited access to our best trading and investing ideas. The best-case scenario if you're a bull would be some sideways action, almost boring to a degree but holding the prior week's low on the S&P 500 at 5500. Looking Into the Future: Here's My 2025 Stock Pick -------------------------------------------------- A Rising Star in the AI-Powered Economy Is My Top Stock Pick for 2025 --------------------------------------------------------------------- By Bob ByrneDec 24, 2024 9:30 AM EST Why an India-Focused ETF Is Asia's Top Investment Pick for 2025 --------------------------------------------------------------- Thanks to Trump, This Financial Behemoth Is My Stock Pick for 2025 ------------------------------------------------------------------ By Bob LangDec 18, 2024 10:30 AM EST More TheStreet Pro Authors"
    },
    {
      "WEBPAGE_TITLE": "GameStop stock slips after company announces plans to raise $1.3 billion to buy bitcoin - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/gamestop-stock-slips-after-company-announces-plans-to-raise-13-billion-to-buy-bitcoin-205250420.html",
      "WEBPAGE_CONTENT": "Breaking News • 2 hours ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs Breaking News • 9 hours ago Dow, S&P 500, Nasdaq hold broadly steady as Trump keeps Wall Street guessing on tariffs News • 2 days ago US stocks closed near session highs Monday amid reports that the next wave of tariffs will be narrower than expected. News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 3 days ago How Trump tariffs could affect the sports industry — including golf Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs"
    },
    {
      "WEBPAGE_TITLE": "Automakers warn new Trump tariffs will boost costs, cut vehicle sales - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/automakers-warn-trump-tariffs-boost-194250955.html",
      "WEBPAGE_CONTENT": "Breaking News • 2 days ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs Breaking News • 2 days ago The Nasdaq led declines, sinking over 2%, as the White House said Trump would announce new auto tariffs later today. Breaking News • 2 days ago Dow, S&P 500, Nasdaq hold broadly steady as Trump keeps Wall Street guessing on tariffs Breaking News • 3 days ago Stocks edge higher as Wall Street navigates Trump's plans for tariffs Breaking News • 4 days ago Dow, S&P 500, Nasdaq jump amid hopes that Trump will soften the next wave of tariffs News • 5 days ago How Trump tariffs could affect the sports industry — including golf"
    },
    {
      "WEBPAGE_TITLE": "Nvidia stock sinks 5% amid tech rout, report on China environmental guidelines - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/nvidia-stock-sinks-5-amid-tech-rout-report-on-china-environmental-guidelines-170321915.html",
      "WEBPAGE_CONTENT": "Breaking News • 4 hours ago Dow, S&P 500, Nasdaq hold broadly steady as Trump keeps Wall Street guessing on tariffs News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' Breaking News • 2 days ago Dow, S&P 500, Nasdaq jump amid hopes that Trump will soften the next wave of tariffs News • 2 days ago How Trump tariffs could affect the sports industry — including golf Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs Breaking News • 5 days ago Stocks slip as Wall Street fails to build on Wednesday's Fed-fueled rally"
    },
    {
      "WEBPAGE_TITLE": "Walmart CEO Doug McMillon says customers are exhibiting ‘stressed behaviors’—and it’s already tanked the company’s valuation by $22 billion - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/walmart-ceo-doug-mcmillon-says-172736560.html",
      "WEBPAGE_CONTENT": "Breaking News • 17 hours ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs Breaking News • 23 hours ago Dow, S&P 500, Nasdaq hold broadly steady as Trump keeps Wall Street guessing on tariffs News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' News • 3 days ago How Trump tariffs could affect the sports industry — including golf News • 3 days ago The perils of trying to time the market Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs"
    },
    {
      "WEBPAGE_TITLE": "Delaware passes law designed to stop more Elon Musks from leaving state - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/delaware-passes-law-designed-to-stop-more-elon-musks-from-leaving-state-164403802.html",
      "WEBPAGE_CONTENT": "Breaking News • 4 hours ago Dow, S&P 500, Nasdaq hold broadly steady as Trump keeps Wall Street guessing on tariffs News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' Breaking News • 2 days ago Dow, S&P 500, Nasdaq jump amid hopes that Trump will soften the next wave of tariffs News • 2 days ago How Trump tariffs could affect the sports industry — including golf News • 3 days ago The perils of trying to time the market Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs"
    },
    {
      "WEBPAGE_TITLE": "US weekly jobless claims edge lower - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/us-weekly-jobless-claims-edge-123836616.html",
      "WEBPAGE_CONTENT": "Breaking News • 17 hours ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' News • 3 days ago How Trump tariffs could affect the sports industry — including golf News • 3 days ago The perils of trying to time the market Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs Breaking News • 6 days ago Trump signs order to eliminate Department of Education 'once and for all'"
    },
    {
      "WEBPAGE_TITLE": "Barclays axes end-of-year target for S&P 500 - Sherwood News",
      "WEBPAGE_URL": "https://sherwood.news/markets/barclays-axes-end-of-year-target-for-s-and-p-500/",
      "WEBPAGE_CONTENT": "Barclays US equity analysts cut their aggregate earnings estimates and year-end price target on the S&P 500 Wednesday, citing uncertainty and the likely hit to profitability posed by the Trump administration’s ongoing tariff bonanza. TD Cowen analysts, whose report on MicrosoftMSFT $389.30 (-1.35%)’s dimming demand for data center projects last month weighed on AI infrastructure and energy names, said that the company had walked away from 2 gigawatts’ worth of data centers. Nia Warfield 4h Cintas shares pop after the uniform maker tops Q3 earnings expectations The stock is the best performer in the S&P 500 today."
    },
    {
      "WEBPAGE_TITLE": "Delaware just passed a ‘billionaires bill’ to keep Zuckerberg from following Musk out the door - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/delaware-just-passed-billionaires-bill-124000987.html",
      "WEBPAGE_CONTENT": "Breaking News • 7 hours ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' News • 3 days ago How Trump tariffs could affect the sports industry — including golf News • 5 days ago 3 of Goldman Sachs' best investing tips for currently volatile markets Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs Breaking News • 6 days ago Trump signs order to eliminate Department of Education 'once and for all'"
    },
    {
      "WEBPAGE_TITLE": "S&P 500 relief rally likely to be short-lived: JPMorgan - Investing.com",
      "WEBPAGE_URL": "https://www.investing.com/news/stock-market-news/sp-500-relief-rally-likely-to-be-shortlived-jpmorgan-3944003",
      "WEBPAGE_CONTENT": "Indices Futures S&P 500 Futures Stocks Top Bank Stocks ETC/USD Currency Futures Stock Markets Stock Markets Futures Chart Stocks Chart Interactive Stocks Chart Stock Brokers Master Stocks Master Stock Analysis Top Stocks Stock ScreenerEconomic Calendar Stock Markets Stock Markets Investing.com -- The recent relief rally in the S&P 500 may not last, as JPMorgan analysts warn that momentum unwinds have further room to go and policy uncertainty continues to weigh on markets. Which stock should you buy in your very next trade? Stocks Stock market today: S&P 500 rallies on hopes for softer tariffs Stocks in this Strategy Stocks in this Strategy Stocks in this Strategy Stocks in this Strategy Stocks in this Strategy Stocks in this Strategy"
    },
    {
      "WEBPAGE_TITLE": "Robinhood, Moving Beyond Meme Stocks, Now Wants to Be Your Bank - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/robinhood-moving-beyond-meme-stocks-013000978.html",
      "WEBPAGE_CONTENT": "Breaking News • 15 hours ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' News • 3 days ago How Trump tariffs could affect the sports industry — including golf News • 3 days ago The perils of trying to time the market News • 5 days ago 3 of Goldman Sachs' best investing tips for currently volatile markets Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs"
    },
    {
      "WEBPAGE_TITLE": "US robotics companies push for national strategy, including a central office, to compete with China - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/us-robotics-companies-push-national-003332644.html",
      "WEBPAGE_CONTENT": "Breaking News • 6 hours ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs Breaking News • 8 hours ago The Nasdaq led declines, sinking over 2%, as the White House said Trump would announce new auto tariffs later today. News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' News • 3 days ago How Trump tariffs could affect the sports industry — including golf Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs"
    },
    {
      "WEBPAGE_TITLE": "Dow Set to Open Up Amid Hope for Trump Tariffs - Barron's",
      "WEBPAGE_URL": "https://www.barrons.com/livecoverage/stock-market-today-032425",
      "WEBPAGE_CONTENT": "Stock Market Today: Dow, S&P 500, Nasdaq Set to Open Up; Trump Tariff Hope; Nvidia, Tesla, Super Micro, Palantir, More Movers U.S. stocks looked set to rise again on Monday, with investors hopeful President Donald Trump’s “Liberation Day” tariffs won’t be as harsh as he’s previously signaled. Tariff talk looks likely to dominate the agenda for markets this week, although manufacturing and servicing Purchasing Managers’ Index data due out Monday could help to give investors a better sense of how the U.S. economy is holding up. Tariff talk looks likely to dominate the agenda for markets this week, although manufacturing and servicing Purchasing Managers’ Index data due out Monday could help to give investors a better sense of how the U.S. economy is holding up."
    },
    {
      "WEBPAGE_TITLE": "Nvidia (NVDA) Will Be a Winner Going Forward, Stock Market Veteran Says - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/nvidia-nvda-winner-going-forward-153018337.html",
      "WEBPAGE_CONTENT": "Breaking News • 6 hours ago Dow, S&P 500, Nasdaq hold broadly steady as Trump keeps Wall Street guessing on tariffs News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' News • 2 days ago How Trump tariffs could affect the sports industry — including golf News • 5 days ago Wall Street is turning its attention back to the main issues that have been plaguing the stock market over the past month Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs"
    },
    {
      "WEBPAGE_TITLE": "The Dow Keeps Falling. The Latest Data Stink Like Stagflation. - Barron's",
      "WEBPAGE_URL": "https://www.barrons.com/livecoverage/stock-market-today-032825/card/the-dow-keeps-falling-the-latest-data-stink-like-stagflation--dFb2mjJQoGedqpsxE5iG",
      "WEBPAGE_CONTENT": "Stock Market News: Dow Drops 700 Points After Latest Data on Inflation, Consumer Sentiment “What was really interesting was that if not for the consumer front-running the tariffs (goods spending rose +0.7% MoM), we would have seen outright contraction in real consumer outlays because spending on services dropped -0.2%, which is something we have not seen happen in over three years,” he writes. Rosenberg wasn't the only market observer using \"stagflation\" to describe the recent numbers: Andrew Brenner, head of international fixed income at NatAlliance Securities, titled an update to clients \"Stagflation Is Here...One Year Michigan Inflation Hits 5%..Sentiment Lower.\" DJIA DJIA (Dow Jones Global) 41583.90-715.80-1.69%S&P 500 SPX (S&P US) 5580.94-112.37-1.97%Nasdaq COMP (Nasdaq) 17322.99-481.04-2.70%"
    },
    {
      "WEBPAGE_TITLE": "Even Wall Street’s most committed bears expect a stock-market rebound - MarketWatch",
      "WEBPAGE_URL": "https://www.marketwatch.com/story/even-wall-streets-most-committed-bears-expect-a-stock-market-rebound-1b46ff76",
      "WEBPAGE_CONTENT": "Even Wall Street’s most committed bears expect a stock-market rebound - MarketWatch Even Wall Street’s most committed bears expect a stock-market rebound Best Money Market Accounts Even Wall Street’s most committed bears expect a stock-market rebound The volatility that has seized the U.S. stock market showed no signs of slowing down this week — although the S&P 500 Bannister recommended that long-term investors interested in putting money to work now consider defensive names, like utilities and healthcare stocks — although he acknowledged that it is often the erstwhile market leaders the benefit the most when the market rebounds. The 14-day relative strength index for the S&P 500 dipped below 30 last week, according to Dow Jones Market Data. Even Wall Street’s most committed bears expect a stock-market rebound"
    },
    {
      "WEBPAGE_TITLE": "Trump announces 25% tariffs on all foreign-made vehicles, some auto parts - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/trump-announces-25-tariffs-on-all-foreign-made-vehicles-some-auto-parts-004858848.html",
      "WEBPAGE_CONTENT": "Breaking News • 5 hours ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs Breaking News • 7 hours ago The Nasdaq led declines, sinking over 2%, as the White House said Trump would announce new auto tariffs later today. News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' News • 3 days ago How Trump tariffs could affect the sports industry — including golf Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs"
    },
    {
      "WEBPAGE_TITLE": "All Eyes on Tesla Stock Ahead of Q1 Deliveries Report; Here’s What Daniel Ives Expects - TipRanks",
      "WEBPAGE_URL": "https://www.tipranks.com/news/all-eyes-on-tesla-stock-ahead-of-q1-deliveries-report-heres-what-daniel-ives-expects",
      "WEBPAGE_CONTENT": "[Premium](https://lp.tipranks.com/go-premium-fp-short?llf=paid-only-article&custom18=news \"Upgrade to Premium to unlock this investment idea\") Stock Market News Today, 3/28/25 – Futures Sink amid Tariff Threats and Hot Inflation Report [Sirisha Bhogaraju](https://www.tipranks.com/news/author/sirisha-bhogaraju)20h ago [DIA](https://www.tipranks.com/news/topic/dia)[QQQ](https://www.tipranks.com/news/topic/qqq) [Premium](https://lp.tipranks.com/go-premium-fp-short?llf=paid-only-article&custom18=news \"Upgrade to Premium to unlock this investment idea\") Harmony Gold Mining Stock (HMY) Hits Record Highs Amidst Surging Gold Prices [Casey Dylan, CIMA](https://www.tipranks.com/news/author/cdylanempiricasg-com)44m ago [HMY](https://www.tipranks.com/news/topic/hmy) [Premium](https://lp.tipranks.com/go-premium-fp-short?llf=paid-only-article&custom18=news \"Upgrade to Premium to unlock this investment idea\") AAR Stock (AIR) Tumbles After Q3 Revenue Miss, Yet Analysts Maintain Confidence [Casey Dylan, CIMA](https://www.tipranks.com/news/author/cdylanempiricasg-com)3h ago [AIR](https://www.tipranks.com/news/topic/air) [Premium](https://lp.tipranks.com/go-premium-fp-short?llf=paid-only-article&custom18=news \"Upgrade to Premium to unlock this investment idea\") Stock Market News Today, 3/28/25 – Futures Sink amid Tariff Threats and Hot Inflation Report [Sirisha Bhogaraju](https://www.tipranks.com/news/author/sirisha-bhogaraju)20h ago [DIA](https://www.tipranks.com/news/topic/dia)[QQQ](https://www.tipranks.com/news/topic/qqq)"
    },
    {
      "WEBPAGE_TITLE": "Musk-Powered TSLA Stock Backlash Begins to Fade - TipRanks",
      "WEBPAGE_URL": "https://www.tipranks.com/news/musk-powered-tsla-stock-backlash-begins-to-fade",
      "WEBPAGE_CONTENT": "[Premium](https://lp.tipranks.com/go-premium-fp-short?llf=paid-only-article&custom18=news \"Upgrade to Premium to unlock this investment idea\") Stock Market News Today, 3/27/25 – Futures Fall amid Tariffs and New Economic Data [Radhika Saraogi](https://www.tipranks.com/news/author/radhika-saraogi)3h ago [DIA](https://www.tipranks.com/news/topic/dia)[QQQ](https://www.tipranks.com/news/topic/qqq) [Premium](https://lp.tipranks.com/go-premium-fp-short?llf=paid-only-article&custom18=news \"Upgrade to Premium to unlock this investment idea\") AppLovin Stock (APP) Plunges 20% as Company Targeted by a Third Short Seller [Joel Baglole](https://www.tipranks.com/news/author/joel-bagloletipranks-com)29m ago [APP](https://www.tipranks.com/news/topic/app)[META](https://www.tipranks.com/news/topic/meta) [Premium](https://lp.tipranks.com/go-premium-fp-short?llf=paid-only-article&custom18=news \"Upgrade to Premium to unlock this investment idea\") Stock Market News Today, 3/27/25 – Futures Fall amid Tariffs and New Economic Data [Radhika Saraogi](https://www.tipranks.com/news/author/radhika-saraogi)3h ago [DIA](https://www.tipranks.com/news/topic/dia)[QQQ](https://www.tipranks.com/news/topic/qqq) [Premium](https://lp.tipranks.com/go-premium-fp-short?llf=paid-only-article&custom18=news \"Upgrade to Premium to unlock this investment idea\") Yellowstone Drama Gives Little Help to Paramount Stock (NASDAQ:PARA) [Steve Anderson](https://www.tipranks.com/news/author/steveanderson)3h ago [PARA](https://www.tipranks.com/news/topic/para) [Premium](https://lp.tipranks.com/go-premium-fp-short?llf=paid-only-article&custom18=news \"Upgrade to Premium to unlock this investment idea\") GameStop Stock (GME) Plunges Over 20% as Investors Fret Over Billion Dollar Bitcoin Pivot [David Craik](https://www.tipranks.com/news/author/david-craik)5h ago [GME](https://www.tipranks.com/news/topic/gme)"
    },
    {
      "WEBPAGE_TITLE": "Nvidia, Tesla, Dollar Tree, Chewy, GameStop, Nintendo: Stocks to watch - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/nvidia-tesla-dollar-tree-chewy-120500084.html",
      "WEBPAGE_CONTENT": "Breaking News • 1 hour ago Dow, S&P 500, Nasdaq hold broadly steady as Trump keeps Wall Street guessing on tariffs Breaking News • 2 days ago Dow, S&P 500, Nasdaq jump amid hopes that Trump will soften the next wave of tariffs News • 2 days ago How Trump tariffs could affect the sports industry — including golf News • 4 days ago 3 of Goldman Sachs' best investing tips for currently volatile markets Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs Breaking News • 5 days ago Trump signs order to eliminate Department of Education 'once and for all' Breaking News • 5 days ago Stocks slip as Wall Street fails to build on Wednesday's Fed-fueled rally"
    },
    {
      "WEBPAGE_TITLE": "Why baby boomers may hold the cards to any Trump plan to rescue stocks from the selloff - MarketWatch",
      "WEBPAGE_URL": "https://www.marketwatch.com/story/why-baby-boomers-may-hold-the-cards-to-any-trump-plan-to-rescue-stocks-from-the-selloff-5f68cfe5",
      "WEBPAGE_CONTENT": "Best Money Market Accounts Stocks got a brief shot of confidence earlier this week after the Federal Reserve kept interest rates steady, with Chair Jerome Powell saying that “hard” economic data still looks good and that inflation stemming from tariffs may be “transitory.” The White House has also been quieter on the tariff front, which appears to be helping support stocks. With half of all spending in the U.S. now driven by top-earning households, according to Moody’s Analytics, the big worry for the economy this time around would be a sustained drop in the stock market that slashes wealthy people’s consumption habits. He added: “There’s no doubt that the stock-market increases have contributed to that.” The S&P 500 has gained more than 20% in each of the past two years."
    },
    {
      "WEBPAGE_TITLE": "Auto industry rocked by Trump's 25% tariffs on US imports - Yahoo Finance",
      "WEBPAGE_URL": "https://finance.yahoo.com/news/auto-industry-rocked-trumps-25-005508916.html",
      "WEBPAGE_CONTENT": "Breaking News • 16 hours ago Nasdaq, S&P 500 dive, snapping 3-day win streak as Trump preps auto tariffs Breaking News • 19 hours ago The Nasdaq led declines, sinking over 2%, as the White House said Trump would announce new auto tariffs later today. News • 2 days ago Market action shows how tariffs remain the 'primary catalyst' for stocks' recovery News • 2 days ago Trump world cheers markets with talk of narrowing April 2 tariffs to the 'dirty 15' News • 3 days ago How Trump tariffs could affect the sports industry — including golf Breaking News • 5 days ago Stocks slide as Wall Street weighs Fed's message, tariffs"
    }
  ]
}